src/Catalogs/Strings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Strings</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Configurations</xr:Item>
				<xr:Item>Catalog.AccountingRegisters</xr:Item>
				<xr:Item>Catalog.Forms</xr:Item>
				<xr:Item>Catalog.Attributes</xr:Item>
				<xr:Item>Catalog.StandardAttributes</xr:Item>
				<xr:Item>Catalog.AccumulationRegisters</xr:Item>
				<xr:Item>Catalog.InformationRegisters</xr:Item>
				<xr:Item>Catalog.Catalogs</xr:Item>
				<xr:Item>Catalog.Documents</xr:Item>
				<xr:Item>Catalog.TabularSections</xr:Item>
				<xr:Item>Catalog.Commands</xr:Item>
				<xr:Item>Catalog.Templates</xr:Item>
				<xr:Item>Catalog.CommonModules</xr:Item>
				<xr:Item>Catalog.Constants</xr:Item>
				<xr:Item>Catalog.Enums</xr:Item>
				<xr:Item>Catalog.EnumValues</xr:Item>
				<xr:Item>Catalog.FunctionalOptions</xr:Item>
				<xr:Item>Catalog.Roles</xr:Item>
				<xr:Item>Catalog.SessionParameters</xr:Item>
				<xr:Item>Catalog.DataProcessors</xr:Item>
				<xr:Item>Catalog.Reports</xr:Item>
				<xr:Item>Catalog.BusinessProcesses</xr:Item>
				<xr:Item>Catalog.Tasks</xr:Item>
				<xr:Item>Catalog.ChartsOfAccounts</xr:Item>
				<xr:Item>Catalog.ChartsOfCharacteristicTypes</xr:Item>
				<xr:Item>Catalog.ChartsOfCalculationTypes</xr:Item>
				<xr:Item>Catalog.CommonAttributes</xr:Item>
				<xr:Item>Catalog.CalculationRegisters</xr:Item>
				<xr:Item>Catalog.CommandGroups</xr:Item>
				<xr:Item>Catalog.CommonPictures</xr:Item>
				<xr:Item>Catalog.DocumentJournals</xr:Item>
				<xr:Item>Catalog.DocumentNumerators</xr:Item>
				<xr:Item>Catalog.EventSubscriptions</xr:Item>
				<xr:Item>Catalog.ExchangePlans</xr:Item>
				<xr:Item>Catalog.FilterCriteria</xr:Item>
				<xr:Item>Catalog.FunctionalOptionsParameters</xr:Item>
				<xr:Item>Catalog.ScheduledJobs</xr:Item>
				<xr:Item>Catalog.Sequences</xr:Item>
				<xr:Item>Catalog.SettingsStorages</xr:Item>
				<xr:Item>Catalog.HTTPServices</xr:Item>
				<xr:Item>Catalog.WebServices</xr:Item>
				<xr:Item>Catalog.WSReferences</xr:Item>
				<xr:Item>Catalog.XDTOPackages</xr:Item>
				<xr:Item>Catalog.Subsystems</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Configuration</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Configurations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SHA1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Values</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Language</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Languages</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Value</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/Meta_sr/Ext/Module.bsl
Function LanguageByCode(Configuration, LanguageCode) Export
	
	Query = New Query;
	Query.SetParameter("Owner", Configuration);
	Query.SetParameter("LanguageCode", LanguageCode);
	Query.Text =
	"SELECT
	|	Languages.Ref AS Ref
	|FROM
	|	Catalog.Languages AS Languages
	|WHERE
	|	Languages.Owner = &Owner
	|	AND Languages.LanguageCode = &LanguageCode";
	
	QueryResult = Query.Execute(); 
	
	If QueryResult.IsEmpty() Then
		Return Undefined;
	EndIf; 
	
	Return QueryResult.Unload()[0].Ref;
	
EndFunction // LanguageByCode()

Function XDTOFactory() Export
	
	XMLReader = New XMLReader;
	XMLReader.SetString(GetCommonTemplate("MDClasses_2_4").GetText());
	XDTOModel = XDTOFactory.ReadXML(XMLReader);
	XMLReader.Close();
	
	Packages = New Array;
	Packages.Add(XDTOFactory.Packages.Get("http://v8.1c.ru/8.1/data/enterprise/current-config"));
	
	Return New XDTOFactory(XDTOModel, Packages);
	
EndFunction // XDTOFactory()

Function StringCache(Configuration) Export
	
	Query = New Query;
	Query.SetParameter("Configuration", Configuration);
	Query.Text =
	"SELECT
	|	Strings.Ref AS Ref,
	|	Strings.SHA1 AS SHA1
	|FROM
	|	Catalog.Strings AS Strings
	|WHERE
	|	Strings.Configuration = &Configuration";
	
	StringCache = Query.Execute().Unload();
	StringCache.Indexes.Add("Ref");
	
	Return StringCache;
	
EndFunction // StringCache()
